import { TikTok } from 'components/Atoms/Icons/Social';
import React from 'react';
import TikTokIcon from 'assets/svg/tiktok.png';
import FooterExpander from '../FooterExpander/FooterExpander';
import * as S from './Styled';
export const footerData = [
  {
    title: 'TAABU',
    list: [{ name: 'О нас', link: '/about-us' }],
  },
  {
    title: 'ПОКУПАТЕЛЯМ',
    list: [
      { name: 'Как покупать', link: '/how-to-buy/#how-to-block' },
      { name: 'Гарантия подлинности', link: '/how-to-buy/#guarante-block' },
      { name: 'Безопасная сделка', link: '/how-to-buy/#safe-block' },
      { name: 'Доставка и возврат', link: '/how-to-buy/#delivery-block' },
    ],
  },
  {
    title: 'ПРОДАВЦАМ',
    list: [
      { name: 'Как продавать', link: '/how-to-sell/#how-to-block' },
      { name: 'Гарантия подлинности', link: '/how-to-sell/#guarante-block' },
      { name: 'Безопасная сделка', link: '/how-to-sell/#safe-block' },

      { name: 'Комиссия', link: '/how-to-sell/#commission-block' },
    ],
  },
  {
    title: 'ПОМОЩЬ',
    list: [
      { name: 'FAQ', link: '/#faq-block' },
      { name: 'Публичная оферта для продавцов', link: process.env.PUBLIC_URL + '/info/pdf/public-for-seller.pdf', blank: true },
      { name: 'Публичная оферта для покупателей', link: process.env.PUBLIC_URL + '/info/pdf/public-for-customer.pdf', blank: true },
    ],
  },
];

const MobileFooter = () => {
  return (
    <S.StyledMobileFooter>
      {footerData.map((footerItem) => (
        <FooterExpander title={footerItem.title} list={footerItem.list} />
      ))}
      {/* <S.Category>
        <S.CategoryName>Покупателям</S.CategoryName>
        <S.CategoryExpand>
          <svg width="10" height="6" viewBox="0 0 10 6" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M9 1L5 5L1 1" stroke="white" strokeLinecap="round" strokeLinejoin="round" />
          </svg>
        </S.CategoryExpand>
      </S.Category>
      <S.Category>
        <S.CategoryName>Продавцам</S.CategoryName>
        <S.CategoryExpand>
          <svg width="10" height="6" viewBox="0 0 10 6" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M9 1L5 5L1 1" stroke="white" strokeLinecap="round" strokeLinejoin="round" />
          </svg>
        </S.CategoryExpand>
      </S.Category>
      <S.Category>
        <S.CategoryName>Помощь</S.CategoryName>
        <S.CategoryExpand>
          <svg width="10" height="6" viewBox="0 0 10 6" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M9 1L5 5L1 1" stroke="white" strokeLinecap="round" strokeLinejoin="round" />
          </svg>
        </S.CategoryExpand>
      </S.Category> */}
      <S.SocialNets>
        <S.Net>
          <a href="https://vm.tiktok.com/ZMNh6dkEs/" target="_blank">
            <img src={TikTokIcon} width="22" height="22" />
          </a>
        </S.Net>
        <S.Net>
          <a href="https://www.instagram.com/taabu.kz/" target="_blank">
            <svg width="18" height="18" viewBox="0 0 18 18" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path
                fillRule="evenodd"
                clipRule="evenodd"
                d="M9.00013 12.7332C11.062 12.7332 12.7335 11.0617 12.7335 8.99989C12.7335 6.93802 11.062 5.26655 9.00013 5.26655C6.93827 5.26655 5.2668 6.93802 5.2668 8.99989C5.2668 11.0617 6.93827 12.7332 9.00013 12.7332ZM9.00013 11.6666C10.4729 11.6666 11.6668 10.4726 11.6668 8.99989C11.6668 7.52713 10.4729 6.33322 9.00013 6.33322C7.52737 6.33322 6.33346 7.52713 6.33346 8.99989C6.33346 10.4726 7.52737 11.6666 9.00013 11.6666Z"
                fill="white"
              />
              <path d="M13.8001 5.26655C14.0947 5.26655 14.3335 5.02777 14.3335 4.73322C14.3335 4.43867 14.0947 4.19989 13.8001 4.19989C13.5056 4.19989 13.2668 4.43867 13.2668 4.73322C13.2668 5.02777 13.5056 5.26655 13.8001 5.26655Z" fill="white" />
              <path
                fillRule="evenodd"
                clipRule="evenodd"
                d="M5.2668 0.466553C2.61583 0.466553 0.466797 2.61559 0.466797 5.26655V12.7332C0.466797 15.3842 2.61583 17.5332 5.2668 17.5332H12.7335C15.3844 17.5332 17.5335 15.3842 17.5335 12.7332V5.26655C17.5335 2.61559 15.3844 0.466553 12.7335 0.466553H5.2668ZM12.7335 1.53322H5.2668C3.20493 1.53322 1.53346 3.20469 1.53346 5.26655V12.7332C1.53346 14.7951 3.20493 16.4666 5.2668 16.4666H12.7335C14.7953 16.4666 16.4668 14.7951 16.4668 12.7332V5.26655C16.4668 3.20469 14.7953 1.53322 12.7335 1.53322Z"
                fill="white"
              />
            </svg>
          </a>
        </S.Net>
        <S.Net>
          <a href="https://t.me/taabukz" target="_blank">
            <svg width="20" height="16" viewBox="0 0 20 16" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path
                fillRule="evenodd"
                clipRule="evenodd"
                d="M19.6667 2.31276L16.5364 14.4628C16.253 15.5629 14.974 16.0051 14.0675 15.4443C13.3252 14.985 11.7814 14.0781 8.75246 12.4499C8.14995 12.126 7.93413 11.2821 8.45112 10.711L9.9596 9.04473L7.48584 10.4003C6.68753 10.8377 5.70042 11.0925 4.68138 10.8798C3.29827 10.591 1.99969 10.0731 1.60771 9.91018C0.620931 9.49992 0.75535 8.19307 1.61537 7.84153L18.223 1.05301C19.039 0.71946 19.8867 1.4587 19.6667 2.31276ZM2.01896 8.82889C1.97534 8.84672 1.97369 8.90716 2.01721 8.92525C2.38986 9.08018 3.61522 9.56749 4.89939 9.8356C5.60948 9.98386 6.3371 9.81341 6.97326 9.46482L14.167 5.52297C14.3252 5.43628 14.4835 5.63692 14.3625 5.77066L9.24188 11.4269C9.21863 11.4526 9.22698 11.494 9.2575 11.5104C12.2967 13.1441 13.861 14.0622 14.6287 14.5372C14.9536 14.7382 15.4082 14.5666 15.5035 14.1967L18.6338 2.04664C18.6349 2.04239 18.6306 2.03871 18.6266 2.04037L2.01896 8.82889Z"
                fill="white"
              />
            </svg>
          </a>
        </S.Net>
        <S.Net>
          <a href="https://wa.me/+77068368442" target="_blank">
            {' '}
            <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path
                fillRule="evenodd"
                clipRule="evenodd"
                d="M7.95765 5.02195C8.16482 5.07824 8.30567 5.25785 8.39286 5.45403L9.1881 7.24331C9.29166 7.47632 9.24736 7.76978 9.11256 7.98621C8.8934 8.33809 8.64467 8.80757 8.81998 9.18322C9.25953 10.125 9.86812 10.7003 10.7864 11.1462C11.1615 11.3284 11.6278 11.061 11.9797 10.8372C12.1824 10.7083 12.4682 10.6591 12.6869 10.7585L14.5519 11.6068C14.7444 11.6944 14.9205 11.8338 14.9769 12.0377C15.273 13.1089 13.9797 14.4862 12.9806 14.4862C12.0001 14.4862 11.0291 14.2931 10.1232 13.9179C9.21733 13.5426 8.39421 12.9926 7.70087 12.2993C7.00752 11.606 6.45753 10.7828 6.0823 9.87694C5.70706 8.97104 5.51393 8.0001 5.51393 7.01957C5.51393 6.02192 6.88708 4.73108 7.95765 5.02195ZM8.32554 7.53496L7.59444 5.88997C7.44143 5.90376 7.20205 5.98673 6.92612 6.22446C6.55472 6.54444 6.4206 6.88771 6.4206 7.01957C6.4206 7.88104 6.59028 8.73407 6.91995 9.52997C7.24962 10.3259 7.73282 11.049 8.34198 11.6582C8.95113 12.2673 9.6743 12.7505 10.4702 13.0802C11.2661 13.4099 12.1191 13.5796 12.9806 13.5796C13.1128 13.5796 13.4569 13.4449 13.777 13.0726C14.0159 12.7947 14.0978 12.5545 14.1105 12.4021L12.4185 11.6325C12.2397 11.7449 11.9788 11.8999 11.6893 12.0004C11.3743 12.1098 10.8868 12.2029 10.3903 11.9618C9.30233 11.4335 8.53386 10.714 7.99839 9.56666C7.77344 9.08467 7.85359 8.61106 7.95602 8.2957C8.0544 7.99284 8.20996 7.72223 8.32554 7.53496Z"
                fill="white"
              />
              <path
                fillRule="evenodd"
                clipRule="evenodd"
                d="M10.2669 19.0666C15.4216 19.0666 19.6003 14.8879 19.6003 9.73324C19.6003 4.57858 15.4216 0.399902 10.2669 0.399902C5.11227 0.399902 0.933594 4.57858 0.933594 9.73324C0.933594 11.2886 1.31405 12.7551 1.98697 14.0448C2.05073 14.167 2.0686 14.3084 2.03293 14.4415L0.973042 18.3971C0.866781 18.7936 1.22967 19.1565 1.62624 19.0503L5.5959 17.9866C5.72825 17.9511 5.86884 17.9686 5.99059 18.0315C7.27171 18.693 8.72569 19.0666 10.2669 19.0666ZM18.5336 9.73324C18.5336 14.2988 14.8325 17.9999 10.2669 17.9999C8.89993 17.9999 7.61336 17.6689 6.47999 17.0837C6.1338 16.9049 5.72099 16.8488 5.31983 16.9563L2.24245 17.7809L3.06325 14.7176C3.17138 14.3141 3.11394 13.8988 2.93265 13.5513C2.33731 12.4104 2.00026 11.1127 2.00026 9.73324C2.00026 5.16768 5.70137 1.46657 10.2669 1.46657C14.8325 1.46657 18.5336 5.16768 18.5336 9.73324Z"
                fill="white"
              />
            </svg>
          </a>
        </S.Net>
        <S.Net>
          <a href="https://www.facebook.com/Taabu-105695948854173" target="_blank">
            {' '}
            <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path
                fillRule="evenodd"
                clipRule="evenodd"
                d="M19.5353 10.0001C19.5353 15.1547 15.3566 19.3334 10.202 19.3334C5.04733 19.3334 0.868652 15.1547 0.868652 10.0001C0.868652 4.84542 5.04733 0.666748 10.202 0.666748C15.3566 0.666748 19.5353 4.84542 19.5353 10.0001ZM9.10578 18.2485V14.3793H7.04806C7.0186 14.3793 6.99473 14.3555 6.99473 14.326V11.6612C6.99473 11.6318 7.0186 11.6079 7.04806 11.6079H9.10578V10.1396C9.10578 7.74465 11.5365 6.89762 12.6184 6.89762H14.1754C14.2049 6.89762 14.2288 6.92149 14.2288 6.95095V9.32981C14.2288 9.35926 14.2049 9.38314 14.1754 9.38314H13.2057C12.8058 9.38314 11.8577 9.75274 11.8577 10.4645V11.6079H14.1752C14.2071 11.6079 14.2319 11.6357 14.2282 11.6674L13.9165 14.3322C13.9133 14.3591 13.8906 14.3793 13.8635 14.3793H11.8577V18.1553C15.6595 17.3876 18.522 14.0282 18.522 10.0001C18.522 5.40507 14.797 1.68008 10.202 1.68008C5.60698 1.68008 1.88199 5.40507 1.88199 10.0001C1.88199 14.2235 5.02886 17.7119 9.10578 18.2485ZM9.95911 18.2366V13.526H7.84806V12.4612H9.95911V10.1396C9.95911 9.28139 10.3759 8.71165 10.9401 8.32352C11.5377 7.91235 12.2465 7.75095 12.6184 7.75095H13.3754V8.52981C12.858 8.52981 12.3678 8.6563 11.9259 8.93554C11.5255 9.18853 11.0044 9.68636 11.0044 10.4645V12.4612H13.2762L13.1516 13.526H11.0044V18.2366H9.95911Z"
                fill="white"
              />
            </svg>
          </a>
        </S.Net>
      </S.SocialNets>
      <S.Rules>
        <S.Rule href={process.env.PUBLIC_URL + '/info/pdf/politika-konfidencialnosti.pdf'} target={'_blank'}>
          Публичная оферта и Политика конфиденциальности
        </S.Rule>
        <S.Rule href={process.env.PUBLIC_URL + '/info/pdf/terms-of-use.pdf'} target={'_blank'}>
          Правила пользования
        </S.Rule>
      </S.Rules>
      <S.Copyright>© 2022 TAABU. Все права защищены .</S.Copyright>
    </S.StyledMobileFooter>
  );
};

export default MobileFooter;
